{
  "backend/main.mo": "Defines the canister with service and booking types, in‑memory maps, and CRUD-like methods for services and booking requests.",
  "backend/migration.mo": "Provides a migration that adds a predefined Cancer Care service and updates nextServiceId.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files for reference.",
  "frontend/index.css": "Tailwind base setup with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps pages in AppLayout.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with header, navigation, mobile menu, and Internet Identity login handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a typed backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching services, individual service, creating bookings, and fetching user bookings.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, including color tokens and base typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/src/pages/Booking.tsx": "Implements a booking form with validation, locality selection, and Internet Identity login flow before submitting booking requests.",
  "frontend/src/pages/Home.tsx": "Displays the homepage with a hero section, feature highlights, and navigation buttons for services and bookings.",
  "frontend/src/pages/MyBookings.tsx": "Shows a logged‑in user's booking list with loading states, login prompts, and status badges.",
  "frontend/src/pages/ServiceDetails.tsx": "Loads and displays details for a single service with coverage areas, descriptions, and a booking button.",
  "frontend/src/pages/Services.tsx": "Displays a searchable services list with optional locality filtering and navigation to service detail pages.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme colors, fonts, animations, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Stores the project’s current state, including features, pending requests, metadata, and known issues for a Chennai-focused home healthcare app."
}