{
  "backend/main.mo": "Defines service and booking types with add, fetch, and booking request operations stored in in‑memory maps.",
  "feature_evidence.json": "Empty feature evidence report scaffold.",
  "frontend-file-summaries.txt": "Prewritten summaries for core frontend files including pages, hooks, and config.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variable definitions for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting root div and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for home, services, details, booking, and user bookings.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with header navigation, auth actions, mobile menu, and children rendering.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, status tracking, and identity persistence via context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks to fetch services, service details, create bookings, and load user bookings via the actor.",
  "frontend/src/index.css": "Tailwind root styles defining healthcare‑themed color palette and dark‑mode variants.",
  "frontend/src/main.tsx": "Application entry initializing React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/Booking.tsx": "Booking page with form validation, Internet Identity login flow, and booking request submission for a selected service.",
  "frontend/src/pages/Home.tsx": "Home page with hero section, feature highlights, and navigation to services and user bookings.",
  "frontend/src/pages/MyBookings.tsx": "Displays user bookings after Internet Identity login, showing booking cards, statuses, and loading states.",
  "frontend/src/pages/ServiceDetails.tsx": "Loads and displays details for a single service with coverage, inclusions, and a button to start booking.",
  "frontend/src/pages/Services.tsx": "Lists all services with search and locality filter, showing cards and navigation to service details.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the frontend theme.",
  "project_state.json": "Defines the project's current state, existing features, and pending feature requests for the Chennai-focused healthcare app."
}