{
  "kind": "build_request",
  "title": "Add Cancer Care service package to the catalog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Pre-populate the backend service catalog with a new Cancer Care service package so it appears in the Services list and can be booked like other services.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add cancer"
        ]
      },
      "acceptanceCriteria": [
        "Calling getServices() returns a Service entry whose name clearly indicates Cancer Care (for example, \"Cancer Care Package\"), with a non-empty English description and a non-zero pricePerVisit.",
        "The new Cancer Care service can be opened via getService(serviceId) without trapping.",
        "A booking request can be successfully submitted (requestBooking) for the Cancer Care service and appears in getUserBookings for the caller."
      ]
    }
  ],
  "constraints": [
    "Keep all backend logic in the existing single Motoko actor (backend/main.mo); do not introduce additional backend services.",
    "Do not edit any frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing specialized cancer-treatment workflows, clinician assignment, medical record storage, or tele-consultation features.",
    "Adding third-party integrations (payments, SMS, email, analytics).",
    "Changing the overall UI theme or navigation beyond what is required for the service to appear and be bookable."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}